Before merge, verify that all the following plans are correct. They will be applied as-is after the merge.

#### Terraform plans
<details><summary>ipfs</summary>

```

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  - destroy

Terraform will perform the following actions:

  # github_repository_collaborator.this["ipfs-camp-2022:TheDiscordian"] will be created
  + resource "github_repository_collaborator" "this" {
      + id                          = (known after apply)
      + invitation_id               = (known after apply)
      + permission                  = "admin"
      + permission_diff_suppression = false
      + repository                  = "ipfs-camp-2022"
      + username                    = "TheDiscordian"
    }

  # github_repository_collaborator.this["ipfs-camp-2022:thediscordian"] will be destroyed
  # (because key ["ipfs-camp-2022:thediscordian"] is not in for_each map)
  - resource "github_repository_collaborator" "this" {
      - id                          = "ipfs-camp-2022:thediscordian" -> null
      - permission                  = "admin" -> null
      - permission_diff_suppression = false -> null
      - repository                  = "ipfs-camp-2022" -> null
      - username                    = "TheDiscordian" -> null
    }

  # github_team_membership.this["Repos - Go:ischasny"] will be created
  + resource "github_team_membership" "this" {
      + etag     = (known after apply)
      + id       = (known after apply)
      + role     = "member"
      + team_id  = "3232508"
      + username = "ischasny"
    }

Plan: 2 to add, 0 to change, 1 to destroy.
```

</details>
<!-- Sticky Pull Request Comment -->